{
  "architectures": [
    "OpenPanguVLForConditionalGeneration"
  ],
  "bias": true,
  "auto_map": {
    "AutoConfig": "configuration_openpangu_vl.OpenPanguVLConfig",
    "AutoModel": "modeling_openpangu_vl.OpenPanguVLModel",
    "AutoModelForCausalLM": "modeling_openpangu_vl.OpenPanguVL"
  },
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "eos_token_id": 45892,
  "vision_start_token_id": 45986,
  "vision_end_token_id": 46007,
  "image_token_id": 46005,
  "video_token_id": 144208,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 12800,
  "max_position_embeddings": 131072,
  "max_window_layers": 34,
  "model_type": "openpangu_vl",
  "num_attention_heads": 32,
  "num_hidden_layers": 34,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-05,
  "rope_theta": 64000000.0,

  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.52.4",
  "use_cache": true,
  "use_sliding_window": false,
  "vision_config": {
    "rms_norm_eps": 1e-06,
    "depth": 26,
    "hidden_act": "gelu",
    "hidden_size": 1536,
    "intermediate_size": 4608,
    "num_heads": 16,
    "in_chans": 3,
    "out_hidden_size": 3584,
    "patch_size": 14,
    "spatial_merge_size": 2,
    "spatial_patch_size": 14,
    "window_size": 112,
    "fullatt_block_indexes": [
      5,
      12,
      19,
      25
    ],
    "tokens_per_second": 2,
    "temporal_patch_size": 2
  },
  "rope_scaling": {
    "rope_type": "default",
    "type": "default",
    "mrope_section": [
      10,
      27,
      27
    ],
    "mrope_interleaved": true
  },
  "vocab_size": 153376
}